# Homebrew casks.
#
# Formulae live in mise.toml under [bootstrap.packages]. Casks stay here because
# mise's [bootstrap.packages] can't install them: it only supports plain `.app`
# casks and rejects binary/font/pkg/manpage/bash_completion artifacts (VS Code,
# fonts, docker-desktop, ghostty, kitty, wezterm, dbeaver, keepassxc,
# mullvad-vpn, libreoffice, ...).
#
# VS Code extensions are managed declaratively in .config/vscode/extensions.txt
# (installed by the `vscode` mise task). The `bootstrap` mise task installs the
# casks below with `brew bundle install`.

# Capably / productivity
cask "libreoffice"
cask "1password"
cask "linear"
cask "notion"
cask "notion-calendar"

# Fonts
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Apps
cask "google-chrome"
cask "docker-desktop"
cask "ghostty"
cask "kitty"
cask "wezterm"
cask "visual-studio-code"
cask "monitorcontrol"
cask "rectangle"
cask "mullvad-vpn"
cask "slack"
cask "keepassxc"
cask "dbeaver-community"
cask "lm-studio"
cask "syncthing-app"
cask "steam"
cask "discord"
cask "handy"
