# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "dashlane/tap"

# Dev tooling
brew "mise"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "helm"

# Shell
brew "nushell"
brew "chezmoi"
brew "antidote"
brew "vivid"

# Shell utilities
brew "zoxide" # cd alternative - change directories
brew "eza" # ls alternative - list directory contents
brew "bat" # cat alternative - print file contents
brew "difftastic" # diff alternative - print the diff between files
brew "hyperfine" # time alternative - benchmark cli commands
brew "oha" # ab alternative - benchmark http endpoints
brew "procs" # ps alternative - list os processes
brew "fd" # find alternative - search files by file name
brew "rg" # grep alternative - search files by contents
brew "dust" # du alternative - show directory disk usage
brew "btop" # top alternative - show processes using the most resources
brew "viddy" # watch alternative - rerun a command every n seconds
brew "sevenzip" # tar/zip alternative - compress and decompress archives
brew "tealdeer" # man alternative - help pages
brew "fzf"
brew "jq"
brew "yq"

# GitHub
brew "gh"
brew "dashlane/tap/dashlane-cli"

# Neovim
brew "neovim"
brew "stylua"

# Http & Net
brew "curl"
brew "wget"
brew "netcat"
brew "xh" # curl alternative - make http requests
brew "dog" # dig alternative - lookup dns records

# Fonts
cask "font-meslo-lg-nerd-font"

# Apps
cask "google-chrome"
cask "docker"
cask "kitty"
cask "wezterm"
cask "visual-studio-code"
cask "monitorcontrol"
cask "rectangle"
cask "mullvadvpn"

# VS Code Extensions
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "foam.foam-vscode"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "mushan.vscode-paste-image"
vscode "orta.vscode-jest"
vscode "pomdtr.excalidraw-editor"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "yzhang.markdown-all-in-one"
