# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "dashlane/tap"

# Dev tooling
brew "mise"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "helm"

# Shell
brew "nushell" # Alternative shell
brew "fish" # Alternative shell
brew "antidote" # zsh plugin manager
brew "vivid" # ls colors theme generator
brew "starship" # shell prompt 

# Shell utilities
brew "zoxide" # cd alternative - change directories
brew "eza" # ls alternative - list directory contents
brew "bat" # cat alternative - print file contents
brew "difftastic" # diff alternative - print the diff between files
brew "hyperfine" # time alternative - benchmark cli commands
brew "oha" # ab alternative - benchmark http endpoints
brew "procs" # ps alternative - list os processes
brew "fd" # find alternative - search files by file name
brew "sd" # sed alternative - replace text
brew "choose" # cut alternative - extract text
brew "ripgrep" # grep alternative - search files by contents
brew "dust" # du alternative - show directory disk usage
brew "btop" # top alternative - show processes using the most resources
brew "viddy" # watch alternative - rerun a command every n seconds
brew "sevenzip" # tar/zip alternative - compress and decompress archives
brew "tealdeer" # man alternative - help pages
brew "glow" # markdown viewer
brew "yazi" # filesystem explorer
brew "fzf" # fuzzy finder
brew "topgrade" # multi-system updater
brew "chezmoi" # dotfiles and user config version control

# Data processing
brew "jq"
brew "yq"
brew "jless"
brew "trurl"
brew "xsv"

# Media
brew "ffmpeg"
brew "imagemagick"

# Git
brew "gh"
brew "git-extras"
brew "gitui"
brew "lazygit"
brew "dashlane/tap/dashlane-cli"

# Neovim & Editors
brew "neovim"
brew "helix"
brew "stylua"

# Http & Net
brew "curl"
brew "wget"
brew "netcat"
brew "gping" # ping alternative - test ip address reachability and latency
brew "xh" # curl alternative - make http requests
brew "dog" # dig alternative - lookup dns records
brew "doggo" # dig alternative - lookup dns records 

# Fonts
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Apps
cask "google-chrome"
cask "docker"
cask "kitty"
cask "wezterm"
cask "visual-studio-code"
cask "monitorcontrol"
cask "rectangle"
cask "mullvadvpn"
cask "slack"
cask "keepassxc"
cask "steam"

# VS Code Extensions
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "foam.foam-vscode"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "mushan.vscode-paste-image"
vscode "orta.vscode-jest"
vscode "pomdtr.excalidraw-editor"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "yzhang.markdown-all-in-one"
