# Taps
tap "dashlane/tap"

# Kubernetes & Docker
brew "kubernetes-cli"
brew "kubectx"
brew "helm"
brew "lazydocker"
brew "k9s"

# Shell
brew "fish" # Alternative shell
brew "vivid" # ls colors theme generator
brew "starship" # shell prompt

# Shell utilities
brew "coreutils"
brew "zoxide" # cd alternative - change directories
brew "eza" # ls alternative - list directory contents
brew "bat" # cat alternative - print file contents
brew "difftastic" # diff alternative - print the diff between files
brew "git-delta" # diff alternative - print the diff between files
brew "hyperfine" # time alternative - benchmark cli commands
brew "procs" # ps alternative - list os processes
brew "fd" # find alternative - search files by file name
brew "sd" # sed alternative - replace text
brew "choose-rust" # cut alternative - extract text
brew "ripgrep" # grep alternative - search files by contents
brew "dust" # du alternative - show directory disk usage
brew "btop" # top alternative - show processes using the most resources
brew "viddy" # watch alternative - rerun a command every n seconds
brew "sevenzip" # tar/zip alternative - compress and decompress archives
brew "tealdeer" # man alternative - help pages
brew "glow" # markdown viewer
brew "yazi" # filesystem explorer
brew "broot" # filesystem explorer
brew "fzf" # fuzzy finder
brew "topgrade" # multi-system updater
brew "chezmoi" # dotfiles and user config version control

# Data processing
brew "jq"
brew "yq"
brew "jless"
brew "trurl"
brew "xsv"
brew "pgcli"
brew "lazysql"

# Crpyto
brew "age"
brew "minisign"

# Media
brew "ffmpeg"
brew "imagemagick"

# Git & VCS
brew "gh" # github cli
brew "git-extras" # extra git commands
brew "lazygit" # tui for git (go)
brew "dashlane/tap/dashlane-cli"

# Neovim & Editors & Lua based tooling
brew "neovim"
brew "luarocks"
brew "tree-sitter-cli"
brew "stylua"

# Http & Net
brew "curl"
brew "wget"
brew "netcat"
brew "somo" # port scanner
brew "gping" # ping alternative - test ip address reachability and latency
brew "oha" # ab alternative - benchmark http endpoints
brew "xh" # curl alternative - make http requests
brew "dog" # dig alternative - lookup dns records (keeping for posterity)
brew "doggo" # dig alternative - lookup dns records (since dog is dead)

# Capably
brew "awscli"
brew "watch"
brew "cairo"
brew "libolm"
brew "automake"
brew "libxmlsec1"
brew "pkgconf"
brew "poppler"
brew "postgresql@14"
brew "swig"
brew "llvm"
brew "dbus"
brew "openssl@3"
brew "pango"
cask "libreoffice"
cask "1password"
cask "linear-linear"
cask "notion"
cask "notion-calendar"

# Fonts
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Apps
cask "google-chrome"
cask "docker-desktop"
cask "ghostty"
cask "kitty"
cask "wezterm"
cask "visual-studio-code"
cask "monitorcontrol"
cask "rectangle"
cask "mullvad-vpn"
cask "slack"
cask "keepassxc"
cask "dbeaver-community"
cask "lm-studio"
cask "syncthing-app"
cask "steam"
cask "discord"

# VS Code Extensions

## VS Code Languages
vscode "denoland.vscode-deno" # js/ts - deno
vscode "oven.bun-vscode" # js/ts - bun
vscode "tamasfe.even-better-toml" # toml
vscode "redhat.vscode-yaml" # yaml
vscode "yzhang.markdown-all-in-one" # markdown
vscode "hashicorp.terraform" # hcl
vscode "matheusq94.tfs" # hcl
vscode "mechatroner.rainbow-csv" # csv
vscode "ms-python.debugpy" # python
vscode "ms-python.python" # python
vscode "ms-python.vscode-pylance" # python
vscode "ms-python.vscode-python-envs"
vscode "golang.go" # go
vscode "rust-lang.rust-analyzer" # rust
vscode "ms-vscode.makefile-tools" # c/make
vscode "jakebecker.elixir-ls" # elixir
vscode "thenuprojectcontributors.vscode-nushell-lang" # nu
vscode "ms-azuretools.vscode-docker" # docker (microsoft)
vscode "ms-azuretools.vscode-containers" # docker (microsoft)
vscode "docker.docker" # docker (docker inc)

## VS Code Language Extras
vscode "charliermarsh.ruff" # python
vscode "esbenp.prettier-vscode" # js/html/css
vscode "dbaeumer.vscode-eslint" # js
vscode "orta.vscode-jest" # js
vscode "vitest.explorer" # js
vscode "bradlc.vscode-tailwindcss" # js/css
vscode "mkhl.shfmt" # bash/sh
vscode "timonwong.shellcheck" # bash/sh
vscode "editorconfig.editorconfig" # all
vscode "johnnymorganz.stylua"

## VS Code Themes
vscode "catppuccin.catppuccin-vsc"
vscode "dracula-theme.theme-dracula"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "zhuangtongfa.material-theme"
vscode "mvllow.rose-pine"

## VS Code Tools
vscode "aaron-bond.better-comments"
vscode "connor4312.esbuild-problem-matchers"
vscode "eamodio.gitlens"
vscode "foam.foam-vscode"
vscode "hverlin.mise-vscode"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.extension-test-runner"
vscode "mushan.vscode-paste-image"
vscode "pomdtr.excalidraw-editor"
vscode "ryu1kn.partial-diff"
vscode "anthropic.claude-code"
